In [1]:
#libraries to use
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt
#python's lxml library parses xml and html files
from lxml import html

#use requests to get data from web pages
import requests 

#use requests.get() to get web page with data
page = requests.get('https://tennstate_ftp.sidearmsports.com/custompages/tsutigers/B8713968-6888-4BB4-B12E-9BA4C76282AC/teamgbg.htm')

#parse data on web page using html module.fromstring
mytree = html.fromstring(page.content)

#go to web address above , right click on page and select inspect to get HTML code for data from right side of page
#create XPath query and use xpath function to get data
#date data
date = mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[1:100:10]
date=[a.replace("\xa0","") for a in date]
date=[a.replace(",","") for a in date]
date=[a.replace(".","") for a in date]
date

['Sep 06 2015',
 'Sep 12 2015',
 'Sep 19 2015',
 'Sep 26 2015',
 'Oct 10 2015',
 'Oct 17 2015',
 'Oct 24 2015',
 'Oct 31 2015',
 'Nov 07 2015',
 'Nov 21 2015']

In [2]:
#get attendance data
attendance=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[9:100:10]
attendance=[a.replace("\xa0","") for a in attendance]
attendance=[a.strip() for a in attendance]
attendance=pd.to_numeric(attendance)
attendance

array([22455, 48385, 23413, 18020,  7123, 22144,  9400,  5985,  7897,
        3924], dtype=int64)

In [3]:
#get TSU rushing yards
TSUrushyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[104:320:23]
TSUrushyards=[a.replace("\xa0","") for a in TSUrushyards]
TSUrushyards=pd.to_numeric(TSUrushyards)
TSUrushyards

array([142, 110,  24, 169,  85, 162, 129, 165, 125, 123], dtype=int64)

In [4]:
#get TSU receiving yards
TSUreceiveyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[108:320:23]
TSUreceiveyards=[a.replace("\xa0","") for a in TSUreceiveyards]
TSUreceiveyards=pd.to_numeric(TSUreceiveyards)
TSUreceiveyards

array([188, 304, 184, 238, 205, 125, 222,  76, 329, 221], dtype=int64)

In [5]:
#get TSU kick return yards
TSUkreturnyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[116:340:23]
TSUkreturnyards=[a.replace("\xa0","") for a in TSUkreturnyards]
TSUkreturnyards=pd.to_numeric(TSUkreturnyards)
TSUkreturnyards

array([ 58, 152, 102,  46,  40,  22,   4,  46,  86,  61], dtype=int64)

In [6]:
#get TSU punt return yards
TSUpreturnyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[120:340:23]
TSUpreturnyards=[a.replace("\xa0","") for a in TSUpreturnyards]
TSUpreturnyards=pd.to_numeric(TSUpreturnyards)
TSUpreturnyards

array([38, 48,  0, 15,  4, 22, 11, -2,  3,  9], dtype=int64)

In [7]:
#get TSU total tackles
TSUtackles=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[381:600:23]
TSUtackles=[a.replace("\xa0","") for a in TSUtackles]
TSUtackles=pd.to_numeric(TSUtackles)
TSUtackles

array([47, 83, 83, 68, 71, 60, 65, 62, 92, 53], dtype=int64)

In [8]:
#get TSU tackle yards
TSUtackleyd=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[383:600:23]
TSUtackleyd=[a.replace("\xa0","") for a in TSUtackleyd]
TSUtackleyd=pd.to_numeric(TSUtackleyd)
TSUtackleyd

array([21, 38,  4, 44,  7, 12, 12,  7, 69, 28], dtype=int64)

In [9]:
#get TSU sacks
TSUsacks=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[384:600:23]
TSUsacks=[a.replace("\xa0","") for a in TSUsacks]
TSUsacks=pd.to_numeric(TSUsacks)
TSUsacks

array([1., 5., 0., 4., 0., 0., 0., 0., 8., 3.])

In [10]:
#get TSU sack yards
TSUsackyd=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[385:600:23]
TSUsackyd=[a.replace("\xa0","") for a in TSUsackyd]
TSUsackyd=pd.to_numeric(TSUsackyd)
TSUsackyd

array([12, 31,  0, 22,  0,  0,  0,  0, 55, 25], dtype=int64)

In [11]:
#TSU punts
TSUpunt=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[655:838:19]
TSUpunt=[a.replace("\xa0","") for a in TSUpunt]
TSUpunt=pd.to_numeric(TSUpunt)
TSUpunt

array([5, 5, 7, 8, 6, 7, 5, 7, 6, 5], dtype=int64)

In [12]:
#create data frame
#change dictionary of lists to data frame
list_of_dicts={'date':date,
     'attendance':attendance,
     'TSUrushyards':TSUrushyards,
     'TSUreceiveyards':TSUreceiveyards,
     'TSUkreturnyards':TSUkreturnyards,
     'TSUpreturnyards':TSUpreturnyards,
     'TSUtackles':TSUtackles,
     'TSUtackleyd':TSUtackleyd,
     'TSUsacks':TSUsacks,
     'TSUsackyd':TSUsackyd,
     'TSUpunt':TSUpunt}
df2015=pd.DataFrame(list_of_dicts)
df2015.head()

,date,attendance,TSUrushyards,TSUreceiveyards,TSUkreturnyards,TSUpreturnyards,TSUtackles,TSUtackleyd,TSUsacks,TSUsackyd,TSUpunt
0,Sep 06 2015,22455,142,188,58,38,47,21,1.0,12,5
1,Sep 12 2015,48385,110,304,152,48,83,38,5.0,31,5
2,Sep 19 2015,23413,24,184,102,0,83,4,0.0,0,7
3,Sep 26 2015,18020,169,238,46,15,68,44,4.0,22,8
4,Oct 10 2015,7123,85,205,40,4,71,7,0.0,0,6

In [13]:
#splitting date column into month, day, & year columns 
df2015[['month','day','year']]=df2015.date.str.split(expand=True)
df2015.drop('date',axis=1)
df2015.head()

,date,attendance,TSUrushyards,TSUreceiveyards,TSUkreturnyards,TSUpreturnyards,TSUtackles,TSUtackleyd,TSUsacks,TSUsackyd,TSUpunt,month,day,year
0,Sep 06 2015,22455,142,188,58,38,47,21,1.0,12,5,Sep,06,2015
1,Sep 12 2015,48385,110,304,152,48,83,38,5.0,31,5,Sep,12,2015
2,Sep 19 2015,23413,24,184,102,0,83,4,0.0,0,7,Sep,19,2015
3,Sep 26 2015,18020,169,238,46,15,68,44,4.0,22,8,Sep,26,2015
4,Oct 10 2015,7123,85,205,40,4,71,7,0.0,0,6,Oct,10,2015

In [14]:
#create a new date variable
#change month variable to a 2 digit string variable
df2015['month'] = df2015['month'].str.replace('Aug','08')
df2015['month'] = df2015['month'].str.replace('Sep','09')
df2015['month'] = df2015['month'].str.replace('Oct','10')
df2015['month'] = df2015['month'].str.replace('Nov','11')
df2015['month'] = df2015['month'].str.replace('Dec','12')
#merge month,day and year variables
df2015['date']=df2015['year']+ '-' +df2015['month']+ '-'+df2015['day']
#make date into a datetime variable
df2015['date']= pd.to_datetime(df2015['date'], format='%Y-%m-%d')
#drop individual month,day, variables (keep year variable for later analysis)
df2015=df2015.drop(['month','day'], axis=1)
#make year numeric
df2015['year']=pd.to_numeric(df2015['year'])
df2015.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             10 non-null     datetime64[ns]
 1   attendance       10 non-null     int64
 2   TSUrushyards     10 non-null     int64
 3   TSUreceiveyards  10 non-null     int64
 4   TSUkreturnyards  10 non-null     int64
 5   TSUpreturnyards  10 non-null     int64
 6   TSUtackles       10 non-null     int64
 7   TSUtackleyd      10 non-null     int64
 8   TSUsacks         10 non-null     float64
 9   TSUsackyd        10 non-null     int64
 10  TSUpunt          10 non-null     int64
 11  year             10 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(10)
memory usage: 1.1 KB

In [16]:
#sort data
df2015=df2015.sort_values('date',ignore_index=True)
df2015.head()

,date,attendance,TSUrushyards,TSUreceiveyards,TSUkreturnyards,TSUpreturnyards,TSUtackles,TSUtackleyd,TSUsacks,TSUsackyd,TSUpunt,year
0,2015-09-06,22455,142,188,58,38,47,21,1.0,12,5,2015
1,2015-09-12,48385,110,304,152,48,83,38,5.0,31,5,2015
2,2015-09-19,23413,24,184,102,0,83,4,0.0,0,7,2015
3,2015-09-26,18020,169,238,46,15,68,44,4.0,22,8,2015
4,2015-10-10,7123,85,205,40,4,71,7,0.0,0,6,2015

In [17]:
#save data
df2015.to_csv('2015.csv',encoding='utf-8')